{"token2id": {"00": 0, "000": 1, "10": 2, "100": 3, "11": 4, "12": 5, "1330": 6, "1375": 7, "14": 8, "15": 9, "1709": 10, "200": 11, "2017": 12, "2019": 13, "2023": 14, "2024": 15, "2025": 16, "25": 17, "2541": 18, "30": 19, "3000": 20, "30am": 21, "330": 22, "346": 23, "3d": 24, "3x": 25, "43": 26, "44224": 27, "44240": 28, "44242": 29, "44266": 30, "50": 31, "672": 32, "673": 33, "678": 34, "697": 35, "800": 36, "8222": 37, "877": 38, "about": 39, "accept": 40, "accepted": 41, "accepts": 42, "access": 43, "accessibility": 44, "account": 45, "acme": 46, "act": 47, "action": 48, "ad": 49, "add": 50, "added": 51, "additional": 52, "additionally": 53, "address": 54, "advance": 55, "aeronautics": 56, "affordable": 57, "after": 58, "agree": 59, "ahead": 60, "all": 61, "allergen": 62, "allow": 63, "along": 64, "already": 65, "also": 66, "alumni": 67, "always": 68, "am": 69, "amazing": 70, "amenities": 71, "america": 72, "american": 73, "android": 74, "annual": 75, "another": 76, "answer": 77, "any": 78, "anywhere": 79, "app": 80, "apple": 81, "apply": 82, "architecture": 83, "area": 84, "areas": 85, "arp": 86, "artisan": 87, "artist": 88, "artists": 89, "ask": 90, "asked": 91, "authorized": 92, "automatically": 93, "availability": 94, "available": 95, "ave": 96, "avoid": 97, "away": 98, "awesome": 99, "back": 100, "bacon": 101, "bag": 102, "bagels": 103, "baked": 104, "balance": 105, "banana": 106, "bank": 107, "bar": 108, "basis": 109, "beat": 110, "become": 111, "beef": 112, "beer": 113, "before": 114, "begin": 115, "berry": 116, "best": 117, "better": 118, "between": 119, "beverage": 120, "beverages": 121, "biggest": 122, "bite": 123, "bites": 124, "black": 125, "blend": 126, "bold": 127, "boneless": 128, "bonuses": 129, "bowl": 130, "braille": 131, "brand": 132, "bread": 133, "breakfast": 134, "breast": 135, "brimfield": 136, "bring": 137, "brings": 138, "browns": 139, "browse": 140, "budgeting": 141, "build": 142, "building": 143, "bulk": 144, "bundles": 145, "burger": 146, "burgers": 147, "burrito": 148, "business": 149, "but": 150, "butter": 151, "button": 152, "buy": 153, "ca": 154, "caf": 155, "calendars": 156, "california": 157, "call": 158, "calling": 159, "calorie": 160, "campus": 161, "can": 162, "canada": 163, "cannot": 164, "capicola": 165, "card": 166, "cards": 167, "care": 168, "careers": 169, "cares": 170, "carries": 171, "carry": 172, "carryout": 173, "cash": 174, "cashless": 175, "casual": 176, "cater": 177, "catering": 178, "center": 179, "chain": 180, "chains": 181, "change": 182, "changed": 183, "charge": 184, "charges": 185, "check": 186, "checking": 187, "cheddar": 188, "cheese": 189, "cheeseburger": 190, "chicken": 191, "chili": 192, "chips": 193, "chocolate": 194, "choice": 195, "choices": 196, "choose": 197, "choosing": 198, "chosen": 199, "cinnamon": 200, "classic": 201, "click": 202, "close": 203, "closed": 204, "club": 205, "co": 206, "coca": 207, "code": 208, "coffee": 209, "cola": 210, "collapse": 211, "college": 212, "combo": 213, "combos": 214, "come": 215, "commerce": 216, "commitment": 217, "communities": 218, "community": 219, "company": 220, "concerns": 221, "condiments": 222, "conditions": 223, "connections": 224, "consumer": 225, "contactless": 226, "contain": 227, "contamination": 228, "content": 229, "continuing": 230, "convenient": 231, "cooking": 232, "corn": 233, "corner": 234, "corporate": 235, "country": 236, "coupons": 237, "covered": 238, "craving": 239, "cravings": 240, "cream": 241, "creamy": 242, "create": 243, "credit": 244, "crew": 245, "crisp": 246, "crispy": 247, "croissant": 248, "cross": 249, "crrsaa": 250, "crust": 251, "crusts": 252, "culinary": 253, "cup": 254, "curbside": 255, "currently": 256, "custom": 257, "customer": 258, "customers": 259, "customize": 260, "cut": 261, "daily": 262, "data": 263, "day": 264, "days": 265, "deal": 266, "deals": 267, "decades": 268, "declining": 269, "dedicated": 270, "deli": 271, "delicious": 272, "delighted": 273, "deliver": 274, "delivered": 275, "delivery": 276, "depending": 277, "description": 278, "design": 279, "designed": 280, "dessert": 281, "desserts": 282, "detail": 283, "details": 284, "devour": 285, "different": 286, "dine": 287, "dining": 288, "dinner": 289, "dip": 290, "directions": 291, "directly": 292, "directory": 293, "disclosure": 294, "discounts": 295, "discover": 296, "do": 297, "does": 298, "doesn": 299, "dollar": 300, "dollars": 301, "don": 302, "door": 303, "doordash": 304, "double": 305, "dough": 306, "download": 307, "dr": 308, "drink": 309, "drinks": 310, "drive": 311, "driver": 312, "during": 313, "each": 314, "earn": 315, "earning": 316, "east": 317, "eastway": 318, "easy": 319, "eat": 320, "eating": 321, "eats": 322, "edu": 323, "egg": 324, "egift": 325, "email": 326, "employ": 327, "employment": 328, "en": 329, "end": 330, "engineering": 331, "english": 332, "enjoy": 333, "enjoyable": 334, "ensure": 335, "enter": 336, "environmental": 337, "epic": 338, "equipment": 339, "espa": 340, "espresso": 341, "estate": 342, "even": 343, "events": 344, "ever": 345, "every": 346, "everyday": 347, "exchange": 348, "excluding": 349, "exclusive": 350, "expand": 351, "expanding": 352, "experience": 353, "explore": 354, "express": 355, "extra": 356, "facebook": 357, "facility": 358, "faculty": 359, "family": 360, "famous": 361, "fan": 362, "faq": 363, "faqs": 364, "far": 365, "fast": 366, "favorite": 367, "favorites": 368, "featured": 369, "features": 370, "feed": 371, "feedback": 372, "feeling": 373, "fees": 374, "few": 375, "fi": 376, "filled": 377, "filling": 378, "find": 379, "first": 380, "fitwel": 381, "flashline": 382, "flatbread": 383, "flavor": 384, "flavors": 385, "floor": 386, "flour": 387, "fluffy": 388, "follow": 389, "food": 390, "footlongs": 391, "forest": 392, "forget": 393, "fork": 394, "form": 395, "found": 396, "foundation": 397, "franchisee": 398, "franchising": 399, "franchisor": 400, "free": 401, "french": 402, "frequently": 403, "fresh": 404, "fri": 405, "friday": 406, "fried": 407, "fries": 408, "frosty": 409, "frozen": 410, "fry": 411, "full": 412, "fun": 413, "future": 414, "game": 415, "genoa": 416, "get": 417, "gift": 418, "give": 419, "global": 420, "gluten": 421, "go": 422, "good": 423, "goods": 424, "google": 425, "got": 426, "great": 427, "green": 428, "grill": 429, "grilled": 430, "grind2energy": 431, "grocery": 432, "grubhub": 433, "guarantee": 434, "guests": 435, "guide": 436, "hall": 437, "ham": 438, "hand": 439, "handcrafted": 440, "happy": 441, "has": 442, "hash": 443, "have": 444, "head": 445, "header": 446, "headquarter": 447, "health": 448, "heard": 449, "heerf": 450, "help": 451, "helping": 452, "here": 453, "hickory": 454, "high": 455, "higher": 456, "hiring": 457, "history": 458, "hit": 459, "holder": 460, "holiday": 461, "honey": 462, "hot": 463, "hours": 464, "house": 465, "how": 466, "however": 467, "hungry": 468, "if": 469, "improvement": 470, "inc": 471, "inch": 472, "include": 473, "including": 474, "independently": 475, "info": 476, "information": 477, "ingredients": 478, "innovation": 479, "inquire": 480, "inside": 481, "instagram": 482, "interested": 483, "international": 484, "into": 485, "investors": 486, "involved": 487, "ip": 488, "italian": 489, "item": 490, "items": 491, "javascript": 492, "job": 493, "jobs": 494, "join": 495, "just": 496, "keep": 497, "kent": 498, "key": 499, "kids": 500, "kind": 501, "know": 502, "language": 503, "large": 504, "last": 505, "late": 506, "latest": 507, "leading": 508, "leanpath": 509, "learn": 510, "leave": 511, "let": 512, "lets": 513, "lettuce": 514, "library": 515, "life": 516, "like": 517, "limited": 518, "link": 519, "linkedin": 520, "list": 521, "listing": 522, "listings": 523, "little": 524, "live": 525, "ll": 526, "llc": 527, "load": 528, "local": 529, "located": 530, "location": 531, "locations": 532, "locator": 533, "log": 534, "login": 535, "logo": 536, "long": 537, "look": 538, "looking": 539, "love": 540, "lovers": 541, "lucky": 542, "lunch": 543, "made": 544, "mailing": 545, "main": 546, "make": 547, "making": 548, "many": 549, "map": 550, "maple": 551, "maps": 552, "marinated": 553, "market": 554, "marks": 555, "mastercard": 556, "matter": 557, "may": 558, "mayo": 559, "me": 560, "meal": 561, "meals": 562, "means": 563, "meat": 564, "meats": 565, "media": 566, "medicine": 567, "medium": 568, "melts": 569, "member": 570, "members": 571, "menus": 572, "merchandise": 573, "method": 574, "minimum": 575, "minutes": 576, "mix": 577, "mobile": 578, "moment": 579, "mon": 580, "monday": 581, "monster": 582, "monterey": 583, "more": 584, "morning": 585, "most": 586, "mouth": 587, "must": 588, "mvp": 589, "my": 590, "myway": 591, "name": 592, "national": 593, "nationwide": 594, "nav": 595, "navigate": 596, "near": 597, "nearby": 598, "nearest": 599, "need": 600, "needs": 601, "neighborhood": 602, "never": 603, "new": 604, "news": 605, "next": 606, "night": 607, "no": 608, "north": 609, "not": 610, "note": 611, "notice": 612, "now": 613, "number": 614, "nutrition": 615, "occasion": 616, "off": 617, "offer": 618, "offerings": 619, "offers": 620, "offices": 621, "official": 622, "oh": 623, "ohio": 624, "ol": 625, "old": 626, "once": 627, "one": 628, "onion": 629, "onions": 630, "online": 631, "only": 632, "open": 633, "openings": 634, "opens": 635, "operated": 636, "operation": 637, "opportunities": 638, "opt": 639, "option": 640, "options": 641, "order": 642, "ordering": 643, "orders": 644, "oreo": 645, "original": 646, "other": 647, "out": 648, "outside": 649, "oven": 650, "over": 651, "overview": 652, "own": 653, "owned": 654, "owners": 655, "ozzi": 656, "page": 657, "pan": 658, "parmesan": 659, "participating": 660, "participation": 661, "particular": 662, "parties": 663, "partners": 664, "partnership": 665, "party": 666, "passionate": 667, "pasta": 668, "pastas": 669, "pay": 670, "payment": 671, "payments": 672, "peppercorn": 673, "pepperoni": 674, "peppers": 675, "perfect": 676, "perfection": 677, "perfectly": 678, "personal": 679, "phone": 680, "physical": 681, "pick": 682, "pickup": 683, "pieces": 684, "piled": 685, "pin": 686, "pizza": 687, "pizzas": 688, "place": 689, "places": 690, "plan": 691, "planet": 692, "plans": 693, "play": 694, "plaza": 695, "please": 696, "plenty": 697, "plus": 698, "pm": 699, "podiatric": 700, "points": 701, "policy": 702, "popular": 703, "portions": 704, "positions": 705, "postmates": 706, "potatoes": 707, "pound": 708, "powered": 709, "preferred": 710, "premium": 711, "prepackaged": 712, "prepared": 713, "press": 714, "price": 715, "prices": 716, "pricing": 717, "privacy": 718, "product": 719, "products": 720, "profile": 721, "program": 722, "property": 723, "protein": 724, "proud": 725, "provide": 726, "provided": 727, "provider": 728, "provolone": 729, "pull": 730, "purchase": 731, "purchased": 732, "purchases": 733, "qr": 734, "quadruple": 735, "quality": 736, "questions": 737, "quick": 738, "rack": 739, "ranch": 740, "ravenna": 741, "rd": 742, "re": 743, "read": 744, "ready": 745, "real": 746, "really": 747, "reason": 748, "receive": 749, "recipe": 750, "recipes": 751, "recruiting": 752, "red": 753, "regional": 754, "register": 755, "registered": 756, "related": 757, "reporting": 758, "reports": 759, "request": 760, "required": 761, "reseller": 762, "resellers": 763, "reserved": 764, "respective": 765, "responsible": 766, "rest": 767, "restaurant": 768, "restaurants": 769, "retail": 770, "return": 771, "review": 772, "reward": 773, "rewards": 774, "rich": 775, "right": 776, "rights": 777, "rings": 778, "road": 779, "roasted": 780, "roll": 781, "rollover": 782, "romaine": 783, "rotunda": 784, "route": 785, "run": 786, "salad": 787, "salads": 788, "salami": 789, "salsa": 790, "same": 791, "sandwich": 792, "sandwiches": 793, "sat": 794, "satisfied": 795, "satisfy": 796, "saturday": 797, "sauce": 798, "sauces": 799, "sausage": 800, "savory": 801, "say": 802, "scan": 803, "school": 804, "search": 805, "seasonal": 806, "seating": 807, "security": 808, "see": 809, "select": 810, "selecting": 811, "selection": 812, "sell": 813, "seriously": 814, "serve": 815, "served": 816, "serves": 817, "service": 818, "services": 819, "serving": 820, "set": 821, "settings": 822, "shake": 823, "share": 824, "shared": 825, "shaved": 826, "shop": 827, "show": 828, "shredded": 829, "side": 830, "sides": 831, "sign": 832, "signature": 833, "simple": 834, "since": 835, "single": 836, "site": 837, "sitemap": 838, "sites": 839, "six": 840, "size": 841, "skip": 842, "small": 843, "smoked": 844, "smooth": 845, "snack": 846, "snapchat": 847, "so": 848, "social": 849, "soft": 850, "some": 851, "something": 852, "special": 853, "specials": 854, "specific": 855, "spend": 856, "spices": 857, "spicy": 858, "spv": 859, "square": 860, "st": 861, "stacked": 862, "staff": 863, "starbucks": 864, "start": 865, "started": 866, "state": 867, "statement": 868, "states": 869, "steak": 870, "still": 871, "stop": 872, "store": 873, "stores": 874, "story": 875, "stow": 876, "street": 877, "strips": 878, "student": 879, "stuffed": 880, "sub": 881, "subs": 882, "subway": 883, "such": 884, "summit": 885, "sun": 886, "sunday": 887, "supply": 888, "support": 889, "supreme": 890, "sure": 891, "sustainability": 892, "swag": 893, "sweet": 894, "sweets": 895, "swipe": 896, "swiss": 897, "switch": 898, "taco": 899, "tacos": 900, "take": 901, "takeout": 902, "talented": 903, "talking": 904, "taste": 905, "tastes": 906, "tasty": 907, "tax": 908, "taxes": 909, "team": 910, "teeth": 911, "terms": 912, "text": 913, "than": 914, "their": 915, "them": 916, "then": 917, "there": 918, "these": 919, "they": 920, "thick": 921, "thin": 922, "things": 923, "third": 924, "those": 925, "threat": 926, "through": 927, "throughout": 928, "thru": 929, "thu": 930, "thurs": 931, "thursday": 932, "tiers": 933, "tiktok": 934, "til": 935, "time": 936, "tip": 937, "toasted": 938, "today": 939, "toggle": 940, "tokens": 941, "tomato": 942, "tomatoes": 943, "too": 944, "top": 945, "topped": 946, "topping": 947, "toppings": 948, "tortilla": 949, "tour": 950, "towers": 951, "town": 952, "trademark": 953, "trademarks": 954, "traditional": 955, "transparency": 956, "treat": 957, "treats": 958, "trending": 959, "tri": 960, "triple": 961, "truck": 962, "try": 963, "tue": 964, "tuesday": 965, "turkey": 966, "turn": 967, "twitter": 968, "two": 969, "types": 970, "uber": 971, "unique": 972, "united": 973, "university": 974, "up": 975, "updated": 976, "updates": 977, "use": 978, "used": 979, "using": 980, "value": 981, "values": 982, "varies": 983, "variety": 984, "vary": 985, "ve": 986, "vegan": 987, "veggie": 988, "veggies": 989, "via": 990, "view": 991, "vinaigrette": 992, "visa": 993, "visit": 994, "voted": 995, "wait": 996, "wallet": 997, "want": 998, "warm": 999, "water": 1000, "watering": 1001, "way": 1002, "ways": 1003, "we": 1004, "web": 1005, "website": 1006, "wed": 1007, "wednesday": 1008, "week": 1009, "well": 1010, "what": 1011, "when": 1012, "where": 1013, "whether": 1014, "which": 1015, "while": 1016, "white": 1017, "who": 1018, "why": 1019, "wi": 1020, "wifi": 1021, "will": 1022, "wings": 1023, "within": 1024, "without": 1025, "work": 1026, "working": 1027, "world": 1028, "would": 1029, "wrap": 1030, "wrapped": 1031, "wraps": 1032, "yep": 1033, "yes": 1034, "yourself": 1035, "youtube": 1036}, "doc_count": 37, "min_df": 3, "max_df": 0.9}